In [1]:
#importing libraries
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('PD 2023 Wk 1 Input.csv')
data.shape

(365, 5)

In [3]:
data.head()

,Transaction Code,Value,Customer Code,Online or In-Person,Transaction Date
0,DTB-716-679-576,1448,100001,2,20/03/2023 00:00:00
1,DS-795-814-303,7839,100001,2,15/11/2023 00:00:00
2,DSB-807-592-406,5520,100005,1,14/07/2023 00:00:00
3,DS-367-545-264,7957,100007,2,18/08/2023 00:00:00
4,DSB-474-374-857,5375,100000,2,26/08/2023 00:00:00

In [4]:
target = pd.read_csv('Targets.csv')
target.shape

(2, 5)

In [5]:
target.head()

  Online or In-Person     Q1     Q2     Q3     Q4
0              Online  72500  70000  60000  60000
1           In-Person  75000  70000  70000  60000

In [6]:
#Rename the values in the Online or In-person field, Online of the 1 values and In-Person for the 2 values
target['Online or In-Person'] = target['Online or In-Person'].map({'Online':'1','In-Person':'2'})

In [7]:
target

  Online or In-Person     Q1     Q2     Q3     Q4
0                   1  72500  70000  60000  60000
1                   2  75000  70000  70000  60000

In [8]:
#Change the date to be the quarter
data['Quarter'] =pd.PeriodIndex(data['Transaction Date'],freq='Q')
data['Quarter'] = data['Quarter'].astype(str)

In [9]:
data['Quarter'] = data['Quarter'].str[-1]

In [10]:
#dropping transaction column
data = data.drop(columns='Transaction Date',inplace=True)

In [12]:
target

  Online or In-Person     Q1     Q2     Q3     Q4
0                   1  72500  70000  60000  60000
1                   2  75000  70000  70000  60000

In [ ]:
data['Value']= data['']